In [2]:
# 1.	Define variable types.

In [3]:
import pandas as pd
df = pd.read_csv("auto.csv")

In [4]:
df.head(3)

,Lead_Id,Within24,Within48,Within72,WithinWeek,WithinWeeks,WithinMonth,ContactByEmail,ContactByTelephone,DistanceToDealer,Car Value,LeadProvider_Id,Status,Manufacturer,Model,TradeInModelYear,City,State
0,146,0,0,0,0,0,1,0,1,28.88,7319,LP001,NEW,Toyota,Highlander,2003,Pell City,AL
1,226,0,0,0,0,1,0,0,1,34.15,4563,LP006,USED,Chevrolet,Suburban,1996,Payson,AZ
2,166,0,0,0,0,0,1,0,1,29.42,8046,LP009,NEW,Toyota,Avalon,2007,Farmington,NM

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1499 entries, 0 to 1498
Data columns (total 18 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Lead_Id             1499 non-null   int64
 1   Within24            1499 non-null   int64
 2   Within48            1499 non-null   int64
 3   Within72            1499 non-null   int64
 4   WithinWeek          1499 non-null   int64
 5   WithinWeeks         1499 non-null   int64
 6   WithinMonth         1499 non-null   int64
 7   ContactByEmail      1499 non-null   int64
 8   ContactByTelephone  1499 non-null   int64
 9   DistanceToDealer    1499 non-null   float64
 10  Car Value           1499 non-null   int64
 11  LeadProvider_Id     1499 non-null   object
 12  Status              1499 non-null   object
 13  Manufacturer        1499 non-null   object
 14  Model               1499 non-null   object
 15  TradeInModelYear    1499 non-null   int64
 16  City                1499 non-null   object
 17  State               1499 non-null   object
dtypes: float64(1), int64(11), object(6)
memory usage: 210.9+ KB

In [6]:
df.dtypes

Lead_Id                 int64
Within24                int64
Within48                int64
Within72                int64
WithinWeek              int64
WithinWeeks             int64
WithinMonth             int64
ContactByEmail          int64
ContactByTelephone      int64
DistanceToDealer      float64
Car Value               int64
LeadProvider_Id        object
Status                 object
Manufacturer           object
Model                  object
TradeInModelYear        int64
City                   object
State                  object
dtype: object

In [7]:
# 2.	Give summary of each variables.
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Lead_Id,1499.0,710.554370,429.751722,7.00,332.500,708.00,1083.50,1458.00
Within24,1499.0,0.000000,0.000000,0.00,0.000,0.00,0.00,0.00
Within48,1499.0,0.050033,0.218087,0.00,0.000,0.00,0.00,1.00
Within72,1499.0,0.004003,0.063161,0.00,0.000,0.00,0.00,1.00
WithinWeek,1499.0,0.038025,0.191321,0.00,0.000,0.00,0.00,1.00
WithinWeeks,1499.0,0.240827,0.427728,0.00,0.000,0.00,0.00,1.00
WithinMonth,1499.0,0.362909,0.480999,0.00,0.000,0.00,1.00,1.00
ContactByEmail,1499.0,0.001334,0.036515,0.00,0.000,0.00,0.00,1.00
ContactByTelephone,1499.0,0.997999,0.044706,0.00,1.000,1.00,1.00,1.00
DistanceToDealer,1499.0,65.459753,201.486551,0.63,27.264,33.49,44.67,3349.26
Car Value,1499.0,5892.891928,2351.227710,2007.00,3785.000,5900.00,7865.50,9999.00
TradeInModelYear,1499.0,2002.007338,3.787489,1996.00,1999.000,2002.00,2005.00,2008.00

In [8]:
df.describe(include="O")

       LeadProvider_Id Status Manufacturer   Model           City State
count             1499   1499         1499    1499           1499  1499
unique              10      2           15      43             20     7
top              LP005    NEW       Toyota  Accent  San Francisco    CA
freq               170   1373          156      48             95   350

In [9]:
df.head()

,Lead_Id,Within24,Within48,Within72,WithinWeek,WithinWeeks,WithinMonth,ContactByEmail,ContactByTelephone,DistanceToDealer,Car Value,LeadProvider_Id,Status,Manufacturer,Model,TradeInModelYear,City,State
0,146,0,0,0,0,0,1,0,1,28.88,7319,LP001,NEW,Toyota,Highlander,2003,Pell City,AL
1,226,0,0,0,0,1,0,0,1,34.15,4563,LP006,USED,Chevrolet,Suburban,1996,Payson,AZ
2,166,0,0,0,0,0,1,0,1,29.42,8046,LP009,NEW,Toyota,Avalon,2007,Farmington,NM
3,291,0,0,0,1,0,0,0,1,110.76,5025,LP010,USED,Ferrari,F1,1997,Conway,AR
4,102,0,0,0,0,1,0,0,1,37.09,4826,LP002,NEW,BMW,7 Series,2001,San Francisco,CA

In [10]:
df['ContactByEmail'].value_counts()

ContactByEmail
0    1497
1       2
Name: count, dtype: int64

In [11]:
df['ContactByTelephone'].value_counts()

ContactByTelephone
1    1496
0       3
Name: count, dtype: int64

In [12]:
df['ContactByEmail'].sum()

2

In [13]:
df['ContactByTelephone'].sum()

1496

In [14]:
df[['ContactByTelephone','ContactByEmail']].sum()

ContactByTelephone    1496
ContactByEmail           2
dtype: int64

In [15]:
x = pd.Series([123,45,67,90,9],index=['A',"B","C","D","E"])

In [16]:
x

A    123
B     45
C     67
D     90
E      9
dtype: int64

In [17]:
x.idxmax() # get the index of max value

'A'

In [18]:
x.idxmin() # get the index of min value

'E'

In [19]:
# 3.	Which is the most commonly used mode of contact? 
df[['ContactByTelephone','ContactByEmail']].sum().idxmax()

'ContactByTelephone'

In [20]:
#4.	Within what period of time most leads would prefer to buy the car?

df.iloc[0:,1:7].sum().idxmax()

'WithinMonth'

In [21]:
df.iloc[0:,1:7].sum().max()

544

In [22]:
ans4 = df.iloc[0:,1:7].sum()

In [23]:
ans4.sort_values(inplace=True)

In [24]:
ans4.tail(1)

WithinMonth    544
dtype: int64

In [25]:
# 5.	Who is the best and worst lead provider?
df['LeadProvider_Id'].value_counts()

LeadProvider_Id
LP005    170
LP002    163
LP007    160
LP003    160
LP001    157
LP004    150
LP006    141
LP009    137
LP010    132
LP008    129
Name: count, dtype: int64

In [26]:
# 6.	Do most of the customers prefer to buy new car?
df['Status'].value_counts()

Status
NEW     1373
USED     126
Name: count, dtype: int64

# 7.	Give the list of states with their car model name which is in more demand there?

In [27]:
ans7=df.groupby(["State","Manufacturer","Model"])['Lead_Id'].count().reset_index().rename(columns={'Lead_Id':'count'})

In [28]:
ans7.sort_values(["State","count"],ascending=[True,False],inplace=True)

In [29]:
ans7.groupby("State").first()

      Manufacturer     Model  count
State
AK          Toyota   Corolla      8
AL            Audi        A3     11
AR          Toyota   Corolla     12
AZ           Lexus        LS     10
CA             BMW  3 Series     18
NM            Audi        A6     14
NY            Audi        A8     13

In [30]:
# 8.	Which is the best year for the manufacturer Toyota?
df_toyota = df[df['Manufacturer']=="Toyota"]

In [32]:
df_toyota['TradeInModelYear'].value_counts() # shows 2002 was the best year

TradeInModelYear
2002    19
2007    17
2001    15
1997    14
2003    13
2006    13
2008    13
1999    11
1996    10
2005     9
1998     8
2004     8
2000     6
Name: count, dtype: int64

In [33]:
#9.	Create a new variable by combining the manufacturer name and model.
df['Car Name']=df['Manufacturer']+" "+df['Model']

In [34]:
df['Car Name'].head()

0     Toyota Highlander
1    Chevrolet Suburban
2         Toyota Avalon
3            Ferrari F1
4          BMW 7 Series
Name: Car Name, dtype: object

In [36]:
#10.	Create a new variable and the values conditionally.
# If distance to dealer<10 -very near
# >=10 and <50                    -near
# >=50 and <100                  -far
# >=100                                 -very far
import numpy as np
df['Distance Category']=np.where(df['DistanceToDealer']<10,"Very Near",
                                np.where(df['DistanceToDealer']<50,"Near",
                                        np.where(df['DistanceToDealer']<100,"Far","Ver Far")))

In [37]:
# 11.	 Which is the distance within which most customers lie?
df['Distance Category'].value_counts().idxmax()

'Near'

In [39]:
# 12.	Give a list of car manufacturers and their average car value.
df.groupby('Manufacturer')['Car Value'].mean()

Manufacturer
Acura            5721.596330
Audi             5805.040541
BMW              5771.347518
Chevrolet        5803.949495
Ferrari          6269.215385
Honda            5763.538462
Hyundai          6082.175000
Infiniti         5911.468750
Jaguar           5883.910891
Lexus            6225.507692
Lotus            6138.014286
Mercedes Benz    5269.084746
Suzuki           6126.690000
Toyota           6093.326923
Volvo            5647.301887
Name: Car Value, dtype: float64

In [45]:
#13.	Which state has highest number of leads?
df['State'].value_counts()

State
CA    350
AZ    226
NM    213
AR    212
AL    193
NY    166
AK    139
Name: count, dtype: int64

In [46]:
#14.	Give city wise max value of car deal.
df.groupby('City')['Car Value'].max()

City
Albany           9893
Conway           9770
Courtland        9955
Elberta          9963
Farmington       9986
Foley            9939
Globe            9935
Hondo            9903
Lake City        9734
Las Vegas        9981
Los Angeles      9921
Marion           9963
Meas             9928
New York         9999
North Pole       9977
Payson           9946
Pell City        9870
San Francisco    9982
Valencia         9982
Wassila          9892
Name: Car Value, dtype: int64

In [48]:
#15.	Which manufacturer has the highest market share.
# in terms of demand
df['Manufacturer'].value_counts() # shows Toyota

Manufacturer
Toyota           156
Audi             148
BMW              141
Acura            109
Volvo            106
Honda            104
Jaguar           101
Suzuki           100
Chevrolet         99
Infiniti          96
Hyundai           80
Lotus             70
Ferrari           65
Lexus             65
Mercedes Benz     59
Name: count, dtype: int64

In [50]:
#15.	Which manufacturer has the highest market share.
# in terms of car value
df.groupby('Manufacturer')['Car Value'].sum() # shows Acura

Manufacturer
Acura            623654
Audi             859146
BMW              813760
Chevrolet        574591
Ferrari          407499
Honda            599408
Hyundai          486574
Infiniti         567501
Jaguar           594275
Lexus            404658
Lotus            429661
Mercedes Benz    310876
Suzuki           612669
Toyota           950559
Volvo            598614
Name: Car Value, dtype: int64